The view Id.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public ElementId ViewId { get; }
  Visual Basic
Public ReadOnly Property ViewId As ElementId
	Get
  Visual C++
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
 See Also
  PreviewControl Class
  Autodesk.Revit.UI Namespace